#include <fstream>
#include <vector>
#include <algorithm>
#include <limits>
#include <unordered_map>
using namespace std;

#define V vector
// недостижимое число при рассчёте цены
#define MAX numeric_limits<int>::max()
#define FOR(x, y) for(int x = 0; x <= y; x++)
// сколько мы хотим купить i-ого продукта
#define PAMOUNT(i) products[i].amount
// сколько требуется купить j-ого чтобы применить i-ую скидку
#define SAMOUNT(j) sales[i].amounts[j]

struct Product
{
	int id;
	int cost;
	int amount;
};

struct Sale {
	// в этом массиве ВСЕГДА 5 элементов - сколько требуется
	// купить каждого продукта для скидки
	vector<int> amounts;
	int cost;
};

int main()
{
	ifstream in{ "discount.in" };
	ofstream out{ "discount.out" };

	// да простит меня господь
	// здесь будет храниться минимальная цена при определённом наборе продуктов, например
	// dp[1][0][0][0][0] - мы купили только один экземпляр первого продукта и ничего больше
	// dp[5][5][5][5][5] - скупили весь магазин 😎
	V<V<V<V<V<int>>>>> dp(6, V<V<V<V<int>>>>(6, V<V<V<int>>>(6, V<V<int>>(6, V<int>(6, MAX)))));

	int b;
	in >> b;
	vector<Product> products(5, Product{});
	unordered_map<int, int> remap;
	for (int i = 0; i < b; i++) {
		in >> products[i].id >> products[i].amount >> products[i].cost;
		remap[products[i].id] = i; // неудобно использовать настоящий id продукта (1 <= id <= 999),
								   // поэтому преобразуем в индекс, в каком порядке мы прочитали продукт, т.е. 7 -> 0, 8 -> 1
								   // 
		// задаём индвидуальную цену продукта
		// мини-приём с (i == num): если, например, этот продукт первый, то получится dp[1][0][0][0][0] и т.д.
		dp[i == 0][i == 1][i == 2][i == 3][i == 4] = products[i].cost;
	}

	int s;
	in >> s;
	vector<Sale> sales(s, Sale{});
	for (int i = 0; i < s; i++) {
		int n;
		in >> n;

		// даже если продуктов меньше 5, здесь всё равно 5,
		// т.к. потом в матрице это учитывается
		vector<int> amounts = vector<int>(5, 0);
		for (int j = 0; j < n; j++) {
			int id, amount;
			in >> id >> amount;
			amounts[remap[id]] = amount;
		}

		in >> sales[i].cost;
		// таким же образом задаём цену для всего набора
		dp[amounts[0]][amounts[1]][amounts[2]][amounts[3]][amounts[4]] = sales[i].cost;
		sales[i].amounts = vector<int>(move(amounts));
	}

	// ничего не купили :(
	dp[0][0][0][0][0] = 0;

	// считаем матрицу до состояния когда мы купили нужное кол-во продуктов
	FOR(p1, PAMOUNT(0)) {
		FOR(p2, PAMOUNT(1)) {
			FOR(p3, PAMOUNT(2)) {
				FOR(p4, PAMOUNT(3)) {
					FOR(p5, PAMOUNT(4)) {
						// есть ли смысл вообще считать для данного набора стоимость?
						// (мы начинаем считать с позиции dp[0][0][0][0][0] и мы вряд ли сюда попадём, но всё же)
						if (dp[p1][p2][p3][p4][p5] == MAX) continue;

						// сначала для каждого продукта просчитываем позицию, если мы докупим
						// ещё один экземпляр этого продукта, например для dp[0][0][0][0][0]
						// если мы пытаемся купить 1ый продукт, то мы хотим просчитать dp[1][0][0][0][0]
						for (int i = 0; i < b; i++) {
							int p1n = p1 + (i == 0), p2n = p2 + (i == 1), p3n = p3 + (i == 2),
								p4n = p4 + (i == 3), p5n = p5 + (i == 4);
							if (p1n > 5 || p2n > 5 || p3n > 5 || p4n > 5 || p5n > 5) continue;
							dp[p1n][p2n][p3n][p4n][p5n] = min(dp[p1n][p2n][p3n][p4n][p5n], dp[p1][p2][p3][p4][p5] + products[i].cost);
						}
						
						// теперь пытаемся просчитать для каждой акции, например для первого теста
						// из dp[0][0][0][0][0] в dp[1][2][0][0][0] (станет 10 вместо 1 * 2 + 2 * 5 = 12)
						for (int i = 0; i < s; i++) {
							int p1n = p1 + SAMOUNT(0), p2n = p2 + SAMOUNT(1), p3n = p3 + SAMOUNT(2),
								p4n = p4 + SAMOUNT(3), p5n = p5 + SAMOUNT(4);
							if (p1n > 5 || p2n > 5 || p3n > 5 || p4n > 5 || p5n > 5) continue;
							dp[p1n][p2n][p3n][p4n][p5n] = min(dp[p1n][p2n][p3n][p4n][p5n], dp[p1][p2][p3][p4][p5] + sales[i].cost);
						}
					}
				}
			}
		}
	}

	out << dp[PAMOUNT(0)][PAMOUNT(1)][PAMOUNT(2)][PAMOUNT(3)][PAMOUNT(4)] << endl;
}
